;--------------------------
;	Mercy General Info
;--------------------------

[MercyClassMod X2SoldierClassTemplate]
DisplayName = "Valkyrie"
ClassSummary = "Our valkyries trade personal weapon damage for powerful support abilities that both heal and enhance the lethality of the squad."
AbilityTreeTitles[0] = "Guardian"
AbilityTreeTitles[1] = "Battle Angel"
AbilityTreeTitles[2] = "Valkyrie"
AbilityTreeTitles[3] = "XCOM"

;ALPHABETICAL ORDER (sorta)
RandomNickNames[0]="Angel"
RandomNickNames[1]="Bainbridge"
RandomNickNames[2]="Biot"
RandomNickNames[3]="Bones"
RandomNickNames[4]="Brady"
RandomNickNames[5]="Bypass"
RandomNickNames[6]="Caduceus"
RandomNickNames[7]="Corpus"
RandomNickNames[8]="Coxa"
RandomNickNames[9]="Defib"
RandomNickNames[10]="Derma"
RandomNickNames[11]="Devil"
RandomNickNames[12]="Doc"
RandomNickNames[13]="Feno"
RandomNickNames[14]="Flexion"
RandomNickNames[15]="Gaba"
RandomNickNames[16]="Genius"
RandomNickNames[17]="Glomer"
RandomNickNames[18]="Holist"
RandomNickNames[19]="Hypo"
RandomNickNames[20]="Juxta"
RandomNickNames[21]="Junction"
RandomNickNames[22]="Lumen"
RandomNickNames[23]="Medic"
RandomNickNames[24]="M.D."
RandomNickNames[25]="Neuro"
RandomNickNames[26]="Osteo"
RandomNickNames[27]="Pharmacy"
RandomNickNames[28]="Pulse"
RandomNickNames[29]="Raphe"
RandomNickNames[30]="Rascal"
RandomNickNames[31]="Rattler"
RandomNickNames[32]="Retractor"
RandomNickNames[33]="Rez"
RandomNickNames[34]="Ripcord"
RandomNickNames[35]="Rogue"
RandomNickNames[36]="Saline"
RandomNickNames[37]="Section"
RandomNickNames[38]="Sentinel"
RandomNickNames[39]="Shady"
RandomNickNames[40]="Shakes"
RandomNickNames[41]="Shifter"
RandomNickNames[42]="Shrink"
RandomNickNames[43]="Slider"
RandomNickNames[44]="Stitch"
RandomNickNames[45]="Supine"
RandomNickNames[46]="Swift"
RandomNickNames[47]="Tapper"
RandomNickNames[48]="Teardrop"
RandomNickNames[49]="Toxoid"
RandomNickNames[50]="Trial"
RandomNickNames[51]="Vapor"
RandomNickNames[52]="Vein"
RandomNickNames[53]="Warden"
RandomNickNames[54]="Ziegler"
RandomNickNames[55]="Mercy"
RandomNickNames[56]="Celestial"
RandomNickNames[57]="Mist"
RandomNickNames[58]="Orchid"
RandomNickNames[59]="Verdant"
RandomNickNames[60]="Amber"
RandomNickNames[61]="Cobalt"
RandomNickNames[62]="Fortune"
RandomNickNames[63]="Eidgenossin"
RandomNickNames[64]="Zhuque"

;ALPHABETICAL ORDER
RandomNickNames_Male[0]="Medicine Man"
RandomNickNames_Male[1]="Magic Man"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Female[0]="Sigrun"
RandomNickNames_Female[1]="Witch"
RandomNickNames_Female[2]="Valkyria"
;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="Did someone call a doctor?"
PhotoboothSoloBLines_Male[1]="You needed a doctor?"
PhotoboothSoloBLines_Male[2]="Your support has arrived."
PhotoboothSoloBLines_Male[3]="This is not the end!"
PhotoboothSoloBLines_Male[4]="The battle continues!"
PhotoboothSoloBLines_Male[5]="Heroes never die!"
PhotoboothSoloBLines_Male[6]="I'll be watching over you."
PhotoboothSoloBLines_Male[7]="Always consult your doctor before engaging in strenuous activity."
PhotoboothSoloBLines_Male[8]="Now, where am I needed?"
PhotoboothSoloBLines_Male[9]="Back in the fight."
PhotoboothSoloBLines_Male[10]="Valkyrie online."
PhotoboothSoloBLines_Male[11]="Need a second opinion?"
PhotoboothSoloBLines_Male[12]="I have my eye on you."
PhotoboothSoloBLines_Male[13]="The doctor is in."
PhotoboothSoloBLines_Male[14]="Piece of cake."
PhotoboothSoloBLines_Male[15]="Your guardian angel."

PhotoboothSoloBLines_Female[0]="Did someone call a doctor?"
PhotoboothSoloBLines_Female[1]="You needed a doctor?"
PhotoboothSoloBLines_Female[2]="Your support has arrived."
PhotoboothSoloBLines_Female[3]="This is not the end!"
PhotoboothSoloBLines_Female[4]="The battle continues!"
PhotoboothSoloBLines_Female[5]="Heroes never die!"
PhotoboothSoloBLines_Female[6]="I'll be watching over you."
PhotoboothSoloBLines_Female[7]="Always consult your doctor before engaging in strenuous activity."
PhotoboothSoloBLines_Female[8]="Now, where am I needed?"
PhotoboothSoloBLines_Female[9]="Back in the fight."
PhotoboothSoloBLines_Female[10]="Valkyrie online."
PhotoboothSoloBLines_Female[11]="Need a second opinion?"
PhotoboothSoloBLines_Female[12]="I have my eye on you."
PhotoboothSoloBLines_Female[13]="The doctor is in."
PhotoboothSoloBLines_Female[14]="Piece of cake."
PhotoboothSoloBLines_Female[15]="Your guardian angel."

;--------------------------
;	Mercy Abilities
;--------------------------

[HealingStream X2AbilityTemplate]
LocFriendlyName="Healing Stream"
LocFlyOverText="HealingStreamFlyOverText"
LocLongDescription="Send your GREMLIN to heal an ally within a <Ability:HEALING_STREAM_DISTANCE/>-tile distance. No cooldown and does not end your turn."
LocHelpText="Heal an ally within a <Ability:HEALING_STREAM_DISTANCE/>-tile distance. No cooldown and does not end your turn."
LocPromotionPopupText="<Bullet/> Note that distances are calculated as a straight vector between units. <br/><Bullet/> Healing Stream restores <Ability:HEALING_STREAM_HP/> HP, which increases by +1 for every subsequent GREMLIN tech level. <br/><Bullet/> Healing Stream can be used on yourself. <br/>"

[DamageBuff X2AbilityTemplate]
LocFriendlyName="Damage Buff"
LocFlyOverText="DamageBuffFlyOverText"
LocLongDescription="Use your GREMLIN to allow an ally within a <Ability:DAMAGE_BUFF_DISTANCE/>-tile distance to deal increased damage for the rest of the turn. No cooldown."
LocHelpText="Allow an ally within a <Ability:DAMAGE_BUFF_DISTANCE/>-tile distance to deal increased damage for the rest of the turn. No cooldown."
LocPromotionPopupText="<Bullet/> Note that distances are calculated as a straight vector between units. <br/><Bullet/> Damage Buff gives a +<Ability:DAMAGE_BUFF_DMG/> damage bonus, which increases by +1 for every subsequent GREMLIN tech level. <br/><Bullet/> Almost all attacks benefit from Damage Buff, the notable exception being grenades. <br/><Bullet/> Damage Buff can be used on yourself, though doing so is a waste without proper planning. <br/><Bullet/> This ability ends your turn unless otherwise stated. <br/>"

[Valkyrie X2AbilityTemplate]
LocFriendlyName="Valkyrie"
LocFlyOverText="ValkyrieFlyOverText"
LocLongDescription="While active, Damage Buff no longer ends your turn and you gain a bonus action."
LocHelpText="While active, Damage Buff no longer ends your turn and you gain a bonus action."
LocPromotionPopupText="<Bullet/> Valkyrie itself does not cost an action to activate, but is considered an offensive ability and will break concealment when used. <br/><Bullet/> This ability lasts for 1 turn and has a <Ability:VALKYRIE_COOLDOWN/>-turn cooldown unless otherwise stated. <br/>"

[GuardianAngel X2AbilityTemplate]
LocFriendlyName="Guardian Angel"
LocFlyOverText="GuardianAngelFlyOverText"
LocLongDescription="Gain +<Ability:GUARDIAN_ANGEL_MOVEMENT/> movement for the rest of the turn. <Ability:GUARDIAN_ANGEL_COOLDOWN/>-turn cooldown."
LocHelpText="Gain +<Ability:GUARDIAN_ANGEL_MOVEMENT/> movement for the rest of the turn. <Ability:GUARDIAN_ANGEL_COOLDOWN/>-turn cooldown."
LocPromotionPopupText="<Bullet/> Guardian Angel improves the valkyrie's ability to reposition during combat, either to tend to an ally or retreat to safety. <br/><Bullet/> This ability does not cost an action to activate. <br/>"

[SurprisingAmounts X2AbilityTemplate]
LocFriendlyName="Surprising Amounts"
LocFlyOverText="SurprisingAmountsFlyOverText"
LocLongDescription="Your primary weapon does +<Ability:SURPRISING_AMOUNTS_DAMAGE/> damage and has +<Ability:SURPRISING_AMOUNTS_AIM/> aim."
LocHelpText="Your primary weapon does +<Ability:SURPRISING_AMOUNTS_DAMAGE/> damage and has +<Ability:SURPRISING_AMOUNTS_AIM/> aim."
LocPromotionPopupText="<Bullet/> Surprising Amounts allows the valkyrie to be more on par with other squad members in terms of damage capabilities. <br/>"

[RideOfTheValkyries X2AbilityTemplate]
LocFriendlyName="Ride of the Valkyries"
LocFlyOverText="RideOfTheValkyriesFlyOverText"
LocLongDescription="While Valkyrie is active, Healing Stream’s and Damage Buff’s bonuses are increased by +1."
LocHelpText="While Valkyrie is active, Healing Stream’s and Damage Buff’s bonuses are increased by +1."
LocPromotionPopupText="<Bullet/> Used correctly, the 1-point difference can significantly increase the squad's efficiency with their actions. <br/>"

[Resurrect X2AbilityTemplate]
LocFriendlyName="Resurrect"
LocFlyOverText="ResurrectFlyOverText"
LocLongDescription="Revive and heal an adjacent ally who is unconscious or bleeding out."
LocHelpText="Revive with full health an adjacent ally who is unconscious or bleeding out."
LocPromotionPopupText="<Bullet/> If the ally is bleeding out, stabilizing first is not necessary to Resurrect them. <br/><Bullet/> Resurrect restores +<Ability:RESURRECT_HP/> HP by default. <br/><Bullet/> This ability ends your turn and has <Ability:RESURRECT_CHARGES/> charge per mission unless otherwise stated. <br/>"

[ProtectMe X2AbilityTemplate]
LocFriendlyName="Protect Me"
LocFlyOverText="ProtectMeFlyOverText"
LocLongDescription="You and your allies receive +<Ability:PROTECT_ME_HITMOD/> aim against the first enemy to attack you last turn."
LocHelpText="You and your allies receive +<Ability:PROTECT_ME_HITMOD/> aim against the first enemy to attack you last turn."
LocPromotionPopupText="<Bullet/> Protect Me will trigger even if the enemy's attack missed. <br/>"

[OdinShield X2AbilityTemplate]
LocFriendlyName="Odin's Shield"
LocFlyOverText="OdinShieldFlyOverText"
LocLongDescription="Gain +<Ability:ODIN_SHIELD_DEFENSE/> defense while Valkyrie is active."
LocHelpText="Gain +<Ability:ODIN_SHIELD_DEFENSE/> defense while Valkyrie is active."
LocPromotionPopupText="<Bullet/> Odin's Shield allows the valkyrie to stay in partial cover with relative safety, which opens up new options for positioning. <br/>"

[Anesthetic X2AbilityTemplate]
LocFriendlyName="Anesthetic"
LocFlyOverText="AnestheticFlyOverText"
LocLongDescription="Give an ally shields for 2 turns. Healing Stream is also more effective on this ally."
LocHelpText="Give an ally shields for 2 turns. Healing Stream is also more effective on this ally."
LocPromotionPopupText="<Bullet/> Anesthetic grants +<Ability:ANESTHETIC_SHIELD/> shields and a +1 bonus to Healing Stream. <br/><Bullet/> Unlike the valkyrie's standard abilities, Anesthetic has no range limit and does not use the GREMLIN, making it useful when an ally has to hold out before the valkyrie can get to them. <br/><Bullet/> This ability does not end your turn and has a <Ability:ANESTHETIC_COOLDOWN/>-turn cooldown. <br/>"

[Sleipnir X2AbilityTemplate]
LocFriendlyName="Sleipnir"
LocFlyOverText="SleipnirFlyOverText"
LocLongDescription="Activating Valkyrie now grants you 2 bonus actions instead of 1."
LocHelpText="Activating Valkyrie now grants you 2 bonus actions instead of 1."
LocPromotionPopupText="<Bullet/> Sleipnir is especially useful as XCOM's squad size increases. <br/>"

[SwiftResponse X2AbilityTemplate]
LocFriendlyName="Swift Response"
LocFlyOverText="SwiftResponseFlyOverText"
LocLongDescription="Fire your primary weapon at a target for no action cost. <Ability:SWIFT_RESPONSE_COOLDOWN/>-turn cooldown."
LocHelpText="Fire your primary weapon at a target for no action cost. <Ability:SWIFT_RESPONSE_COOLDOWN/>-turn cooldown."
LocPromotionPopupText="<Bullet/> Given enough training, our valkyries should be able to take full advantage of the lightweight nature of their weapons, squeezing in a few extra shots in the field. <br/>"

[GoGetEm X2AbilityTemplate]
LocFriendlyName="Go Get 'Em"
LocFlyOverText="GoGetEmFlyOverText"
LocLongDescription="Damage buffing an ally also removes any negative mental effects they are suffering from (except unconsciousness)."
LocHelpText="Damage buffing an ally also removes any negative mental effects they are suffering from (except unconsciousness)."
LocPromotionPopupText="<Bullet/> With this ability, allies can recover from being disabled and deliver a decisive counterattack almost immediately. <br/>"

[OdinBlessing X2AbilityTemplate]
LocFriendlyName="Odin's Blessing"
LocFlyOverText="OdinBlessingFlyOverText"
LocLongDescription="Activating Valkyrie also heals you and increases your weapon damage."
LocHelpText="Activating Valkyrie also heals you and increases your weapon damage."
LocPromotionPopupText="<Bullet/> The valkyrie instantly regains +<Ability:ODIN_BLESSING_HP/> HP upon activating Valkyrie and does +<Ability:ODIN_BLESSING_DMG/> damage for as long as Valkyrie is active. If Valhalla is also unlocked, an additional +<Ability:ODIN_BLESSING_HP/> HP will be regained at the start of the next turn. <br/><Bullet/> The damage boost effect is identical to Damage Buff, meaning you cannot stack one on top of the other. <br/><Bullet/> Odin's Blessing also removes physical ailments like fire and acid. <br/>"

[SelfTreatment X2AbilityTemplate]
LocFriendlyName="Self-Treatment"
LocFlyOverText="SelfTreatmentFlyOverText"
LocLongDescription="If wounded, regenerate <Ability:SELF_TREATMENT_HP/> HP each turn. Also gain immunity to fire, acid, and poison."
LocHelpText="If wounded, regenerate <Ability:SELF_TREATMENT_HP/> HP each turn. Also gain immunity to fire, acid, and poison."
LocPromotionPopupText="<Bullet/> HP is automatically regained at the start of the player's turn. <br/>"

[WithYou X2AbilityTemplate]
LocFriendlyName="I'm With You"
LocFlyOverText="WithYouFlyOverText"
LocLongDescription="Squad members are guaranteed to bleed out upon taking fatal damage."
LocHelpText="Squad members are guaranteed to bleed out upon taking fatal damage."
LocPromotionPopupText="<Bullet/> This effect is lost if the valkyrie takes fatal damage. <br/><Bullet/> I'm With You cannot stack; if the player decides to deploy multiple valkyries with the ability, its effects will be linked to only one of them. <br/>"

[Incision X2AbilityTemplate]
LocFriendlyName="Incision"
LocFlyOverText="IncisionFlyOverText"
LocLongDescription="A variant of Damage Buff that gives allies +<Ability:INCISION_CRIT/>% crit chance and +<Ability:INCISION_PIERCE/> armor piercing instead of raw damage."
LocHelpText="A variant of Damage Buff that gives allies +<Ability:INCISION_CRIT/>% crit chance and +<Ability:INCISION_PIERCE/> armor piercing instead of raw damage."
LocPromotionPopupText="<Bullet/> Like Damage Buff, Incision uses the GREMLIN, has no cooldown, ends your turn, and requires allies to be within a <Ability:DAMAGE_BUFF_DISTANCE/>-tile distance. <br/><Bullet/> The valkyrie can use Incision on themselves and its effects also stack on top of Damage Buff, though proper planning is needed for these scenarios. <br/><Bullet/> Incision does not benefit from Valkyrie or any other abilities that affect Damage Buff. <br/>"

[Valhalla X2AbilityTemplate]
LocFriendlyName="Valhalla"
LocFlyOverText="ValhallaFlyOverText"
LocLongDescription="Valkyrie and its effects now lasts 2 turns instead of 1."
LocHelpText="Valkyrie and its effects now lasts 2 turns instead of 1."
LocPromotionPopupText="<Bullet/> Valhalla also extends the duration of the bonuses that can be unlocked for Valkyrie. For instance, Sleipnir with Valhalla results in the valkyrie having 4 actions per turn for 2 turns. <br/>"

[HeroesNeverDie X2AbilityTemplate]
LocFriendlyName="Heroes Never Die"
LocFlyOverText="HeroesNeverDieFlyOverText"
LocLongDescription="Resurrect now restores 100% health and has an extra charge."
LocHelpText="Resurrect now restores 100% health and has an extra charge."
LocPromotionPopupText="<Bullet/> This pairs extremely well with I'm With You, and together with Resurrect these abilities virtually guarantee the survival of several squad members on a mission. <br/>"

[Uninhibited X2AbilityTemplate]
LocFriendlyName="Uninhibited"
LocFlyOverText="UninhibitedFlyOverText"
LocLongDescription="Damage Buff now applies to grenades."
LocHelpText="Damage Buff now applies to grenades."
LocPromotionPopupText="<Bullet/> Affected grenade types are the same as those of Volatile Mixture. <br/>"

[RagnarokMercy X2AbilityTemplate]
LocFriendlyName="Ragnarok"
LocFlyOverText="RagnarokFlyOverText"
LocLongDescription="Valkyrie now has a <Ability:RAGNAROK_COOLDOWN/>-turn cooldown instead of <Ability:VALKYRIE_COOLDOWN/>."
LocHelpText="Valkyrie now has a <Ability:RAGNAROK_COOLDOWN/>-turn cooldown instead of <Ability:VALKYRIE_COOLDOWN/>."
LocPromotionPopupText="<Bullet/> Coupled with Valhalla, this means Valkyrie can theoretically be active for half the time during a mission. <br/>"

[SustainingSuitUnlock X2SoldierAbilityUnlockTemplate]
DisplayName="Valkyrie: Sustaining Suit"
Summary="By combining GREMLIN emergency protocols with scavenged psionic enhancements from ADVENT Priests, our valkyries can replicate the Sustain ability with any armor they use."
